In [9]:
import pandas as pd

In [10]:
df = pd.read_excel("../../data/course_participants.xlsx")
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## Index

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
# change index name
df.index.name = "idx"
df

     user_id   name  age  country  score continent
idx
0       1001   Mark   55    Italy    4.5    Europe
1       1000   John   33      USA    6.7   America
2       1002    Tim   41      USA    3.9   America
3       1003  Jenny   12  Germany    9.0    Europe

In [24]:
df.reset_index().set_index("name").sort_index()

       idx  user_id  age  country  score continent
name
Jenny    3     1003   12  Germany    9.0    Europe
John     1     1000   33      USA    6.7   America
Mark     0     1001   55    Italy    4.5    Europe
Tim      2     1002   41      USA    3.9   America

In [25]:
# use sort_values to sort the rows by one or more columns
df.sort_values(["continent", "age"])

     user_id   name  age  country  score continent
idx
1       1000   John   33      USA    6.7   America
2       1002    Tim   41      USA    3.9   America
3       1003  Jenny   12  Germany    9.0    Europe
0       1001   Mark   55    Italy    4.5    Europe

## Columns